; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	thermograph2 - mode
	spectrograph0 - mode
	image1 - mode
	GroundStation0 - direction
	Star4 - direction
	Star5 - direction
	Star7 - direction
	GroundStation3 - direction
	Star6 - direction
	Star1 - direction
	GroundStation2 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star1)
	(supports instrument2 image1)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star1)
	(supports instrument3 spectrograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
)
(:goal (and
	(pointing satellite0 Planet17)
	(pointing satellite1 Planet12)
	(have_image Planet8 thermograph2)
	(have_image Planet9 image1)
	(have_image Planet10 spectrograph0)
	(have_image Planet11 thermograph2)
	(have_image Planet12 spectrograph0)
	(have_image Star13 image1)
	(have_image Star14 image1)
	(have_image Phenomenon15 thermograph2)
	(have_image Star16 thermograph2)
	(have_image Planet17 thermograph2)
))

)

; plan
1. (turn_to satellite1 star1 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star1)
   goals met: 0 of 12
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 12
3. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 12
4. (turn_to satellite1 planet17 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet17)
   goals met: 0 of 12
5. (take_image satellite1 planet17 instrument2 thermograph2)
   added: (have_image planet17 thermograph2)
   goals met: 1 of 12
6. (turn_to satellite1 planet11 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 planet11)
   goals met: 1 of 12
7. (take_image satellite1 planet11 instrument2 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 2 of 12
8. (turn_to satellite1 planet10 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet10)
   goals met: 2 of 12
9. (take_image satellite1 planet10 instrument2 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 3 of 12
10. (turn_to satellite1 phenomenon15 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon15)
   goals met: 3 of 12
11. (turn_to satellite0 planet17 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet17)
   goals met: 4 of 12
12. (take_image satellite1 phenomenon15 instrument2 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 5 of 12
13. (turn_to satellite1 planet8 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 planet8)
   goals met: 5 of 12
14. (take_image satellite1 planet8 instrument2 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 6 of 12
15. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 6 of 12
16. (take_image satellite1 planet9 instrument2 image1)
   added: (have_image planet9 image1)
   goals met: 7 of 12
17. (turn_to satellite1 star13 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star13)
   goals met: 7 of 12
18. (take_image satellite1 star13 instrument2 image1)
   added: (have_image star13 image1)
   goals met: 8 of 12
19. (turn_to satellite1 star14 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star14)
   goals met: 8 of 12
20. (take_image satellite1 star14 instrument2 image1)
   added: (have_image star14 image1)
   goals met: 9 of 12
21. (turn_to satellite1 star16 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star16)
   goals met: 9 of 12
22. (take_image satellite1 star16 instrument2 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 10 of 12
23. (turn_to satellite1 planet12 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 planet12)
   goals met: 11 of 12
24. (take_image satellite1 planet12 instrument2 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 12 of 12
